; ModuleID = 'treetable_get_linked.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_conf_s = type { ptr, ptr, ptr, ptr }
%struct.rbnode_s = type { ptr, ptr, i8, ptr, ptr, ptr }
%struct.treetable_s = type { ptr, ptr, i64, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"k1\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"k2\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [8 x i8] c"missing\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [3 x i8] c"v1\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [3 x i8] c"v2\00", align 1, !dbg !16
@.str.5 = private unnamed_addr constant [52 x i8] c"treetable_get(t, &k1, &out) == CC_ERR_KEY_NOT_FOUND\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [38 x i8] c"Ex3SymbTestSuite/treetable_get_symb.c\00", align 1, !dbg !23
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1, !dbg !28
@.str.7 = private unnamed_addr constant [10 x i8] c"sorted(t)\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [12 x i8] c"balanced(t)\00", align 1, !dbg !39
@.str.9 = private unnamed_addr constant [37 x i8] c"treetable_get(t, &k1, &out) == CC_OK\00", align 1, !dbg !44
@.str.10 = private unnamed_addr constant [17 x i8] c"*(int*)out == v1\00", align 1, !dbg !49

!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !46, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !51, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 57)
!63 = distinct !DICompileUnit(language: DW_LANG_C11, file: !64, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !79, splitDebugInlining: false, nameTableKind: None)
!64 = !DIFile(filename: "../ex2/treetable.c", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "cd091c12d74f379a3d467a2d81b73c3b")
!65 = !{!66}
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_stat", file: !67, line: 29, baseType: !68, size: 32, elements: !69)
!67 = !DIFile(filename: "../ex2/common.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "e8c1045b469e28a9ccd16d92bf989e73")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DIEnumerator(name: "CC_OK", value: 0)
!71 = !DIEnumerator(name: "CC_ERR_ALLOC", value: 1)
!72 = !DIEnumerator(name: "CC_ERR_INVALID_CAPACITY", value: 2)
!73 = !DIEnumerator(name: "CC_ERR_INVALID_RANGE", value: 3)
!74 = !DIEnumerator(name: "CC_ERR_MAX_CAPACITY", value: 4)
!75 = !DIEnumerator(name: "CC_ERR_KEY_NOT_FOUND", value: 6)
!76 = !DIEnumerator(name: "CC_ERR_VALUE_NOT_FOUND", value: 7)
!77 = !DIEnumerator(name: "CC_ERR_OUT_OF_RANGE", value: 8)
!78 = !DIEnumerator(name: "CC_ITER_END", value: 9)
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !84, globals: !85, splitDebugInlining: false, nameTableKind: None)
!84 = !{!80}
!85 = !{!0, !7, !9, !14, !16, !18, !23, !28, !34, !39, !44, !49, !54, !56, !58}
!86 = !{!"clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)"}
!87 = !{i32 7, !"Dwarf Version", i32 5}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{i32 1, !"wchar_size", i32 4}
!90 = !{i32 8, !"PIC Level", i32 2}
!91 = !{i32 7, !"PIE Level", i32 2}
!92 = !{i32 7, !"uwtable", i32 2}
!93 = !{i32 7, !"frame-pointer", i32 2}
!94 = distinct !DISubprogram(name: "cmp", scope: !64, file: !64, line: 53, type: !95, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !99)
!95 = !DISubroutineType(types: !96)
!96 = !{!81, !97, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!99 = !{}
!100 = !DILocalVariable(name: "e1", arg: 1, scope: !94, file: !64, line: 53, type: !97)
!101 = !DILocation(line: 53, column: 21, scope: !94)
!102 = !DILocalVariable(name: "e2", arg: 2, scope: !94, file: !64, line: 53, type: !97)
!103 = !DILocation(line: 53, column: 37, scope: !94)
!104 = !DILocalVariable(name: "i", scope: !94, file: !64, line: 54, type: !81)
!105 = !DILocation(line: 54, column: 9, scope: !94)
!106 = !DILocation(line: 54, column: 22, scope: !94)
!107 = !DILocation(line: 54, column: 13, scope: !94)
!108 = !DILocalVariable(name: "j", scope: !94, file: !64, line: 55, type: !81)
!109 = !DILocation(line: 55, column: 9, scope: !94)
!110 = !DILocation(line: 55, column: 22, scope: !94)
!111 = !DILocation(line: 55, column: 13, scope: !94)
!112 = !DILocation(line: 57, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !94, file: !64, line: 57, column: 9)
!114 = !DILocation(line: 57, column: 13, scope: !113)
!115 = !DILocation(line: 57, column: 11, scope: !113)
!116 = !DILocation(line: 57, column: 9, scope: !94)
!117 = !DILocation(line: 58, column: 9, scope: !113)
!118 = !DILocation(line: 59, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !94, file: !64, line: 59, column: 9)
!120 = !DILocation(line: 59, column: 14, scope: !119)
!121 = !DILocation(line: 59, column: 11, scope: !119)
!122 = !DILocation(line: 59, column: 9, scope: !94)
!123 = !DILocation(line: 60, column: 9, scope: !119)
!124 = !DILocation(line: 61, column: 5, scope: !94)
!125 = !DILocation(line: 62, column: 1, scope: !94)
!126 = distinct !DISubprogram(name: "treetable_conf_init", scope: !64, file: !64, line: 70, type: !127, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !99)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !131, line: 94, baseType: !132)
!131 = !DIFile(filename: "../ex2/treetable.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "065f0d2b52ad730b442c75c554f59b69")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !131, line: 89, size: 256, elements: !133)
!133 = !{!134, !136, !143, !147}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !132, file: !131, line: 90, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !132, file: !131, line: 91, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!82, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 46, baseType: !142)
!141 = !DIFile(filename: "/tmp/llvm-160-install_O_D_A/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!142 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !132, file: !131, line: 92, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!82, !140, !140}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !132, file: !131, line: 93, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !82}
!151 = !DILocalVariable(name: "conf", arg: 1, scope: !126, file: !64, line: 70, type: !129)
!152 = !DILocation(line: 70, column: 41, scope: !126)
!153 = !DILocation(line: 72, column: 5, scope: !126)
!154 = !DILocation(line: 72, column: 11, scope: !126)
!155 = !DILocation(line: 72, column: 22, scope: !126)
!156 = !DILocation(line: 73, column: 5, scope: !126)
!157 = !DILocation(line: 73, column: 11, scope: !126)
!158 = !DILocation(line: 73, column: 22, scope: !126)
!159 = !DILocation(line: 74, column: 5, scope: !126)
!160 = !DILocation(line: 74, column: 11, scope: !126)
!161 = !DILocation(line: 74, column: 22, scope: !126)
!162 = !DILocation(line: 75, column: 5, scope: !126)
!163 = !DILocation(line: 75, column: 11, scope: !126)
!164 = !DILocation(line: 75, column: 22, scope: !126)
!165 = !DILocation(line: 76, column: 1, scope: !126)
!166 = distinct !DISubprogram(name: "treetable_new", scope: !64, file: !64, line: 87, type: !167, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !99)
!167 = !DISubroutineType(types: !168)
!168 = !{!66, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !131, line: 30, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !64, line: 30, size: 448, elements: !173)
!173 = !{!174, !186, !187, !188, !189, !190, !191}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !172, file: !64, line: 31, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !131, line: 61, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !131, line: 37, size: 384, elements: !178)
!178 = !{!179, !180, !181, !182, !184, !185}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !177, file: !131, line: 40, baseType: !82, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !177, file: !131, line: 44, baseType: !82, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !177, file: !131, line: 48, baseType: !4, size: 8, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !131, line: 52, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !177, file: !131, line: 56, baseType: !183, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !177, file: !131, line: 60, baseType: !183, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !172, file: !64, line: 32, baseType: !175, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !172, file: !64, line: 33, baseType: !140, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !172, file: !64, line: 35, baseType: !135, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !172, file: !64, line: 36, baseType: !137, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !172, file: !64, line: 37, baseType: !144, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !172, file: !64, line: 38, baseType: !148, size: 64, offset: 384)
!192 = !DILocalVariable(name: "tt", arg: 1, scope: !166, file: !64, line: 87, type: !169)
!193 = !DILocation(line: 87, column: 40, scope: !166)
!194 = !DILocalVariable(name: "conf", scope: !166, file: !64, line: 89, type: !130)
!195 = !DILocation(line: 89, column: 19, scope: !166)
!196 = !DILocation(line: 90, column: 5, scope: !166)
!197 = !DILocation(line: 91, column: 38, scope: !166)
!198 = !DILocation(line: 91, column: 12, scope: !166)
!199 = !DILocation(line: 91, column: 5, scope: !166)
!200 = distinct !DISubprogram(name: "treetable_new_conf", scope: !64, file: !64, line: 107, type: !201, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !99)
!201 = !DISubroutineType(types: !202)
!202 = !{!66, !203, !169}
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!206 = !DILocalVariable(name: "conf", arg: 1, scope: !200, file: !64, line: 107, type: !203)
!207 = !DILocation(line: 107, column: 61, scope: !200)
!208 = !DILocalVariable(name: "tt", arg: 2, scope: !200, file: !64, line: 107, type: !169)
!209 = !DILocation(line: 107, column: 79, scope: !200)
!210 = !DILocalVariable(name: "table", scope: !200, file: !64, line: 109, type: !170)
!211 = !DILocation(line: 109, column: 16, scope: !200)
!212 = !DILocation(line: 109, column: 24, scope: !200)
!213 = !DILocation(line: 109, column: 30, scope: !200)
!214 = !DILocation(line: 111, column: 10, scope: !215)
!215 = distinct !DILexicalBlock(scope: !200, file: !64, line: 111, column: 9)
!216 = !DILocation(line: 111, column: 9, scope: !200)
!217 = !DILocation(line: 112, column: 9, scope: !215)
!218 = !DILocalVariable(name: "sentinel", scope: !200, file: !64, line: 114, type: !175)
!219 = !DILocation(line: 114, column: 13, scope: !200)
!220 = !DILocation(line: 114, column: 24, scope: !200)
!221 = !DILocation(line: 114, column: 30, scope: !200)
!222 = !DILocation(line: 116, column: 10, scope: !223)
!223 = distinct !DILexicalBlock(scope: !200, file: !64, line: 116, column: 9)
!224 = !DILocation(line: 116, column: 9, scope: !200)
!225 = !DILocation(line: 117, column: 9, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !64, line: 116, column: 20)
!227 = !DILocation(line: 117, column: 15, scope: !226)
!228 = !DILocation(line: 117, column: 24, scope: !226)
!229 = !DILocation(line: 118, column: 9, scope: !226)
!230 = !DILocation(line: 121, column: 5, scope: !200)
!231 = !DILocation(line: 121, column: 15, scope: !200)
!232 = !DILocation(line: 121, column: 23, scope: !200)
!233 = !DILocation(line: 123, column: 5, scope: !200)
!234 = !DILocation(line: 123, column: 12, scope: !200)
!235 = !DILocation(line: 123, column: 23, scope: !200)
!236 = !DILocation(line: 124, column: 25, scope: !200)
!237 = !DILocation(line: 124, column: 31, scope: !200)
!238 = !DILocation(line: 124, column: 5, scope: !200)
!239 = !DILocation(line: 124, column: 12, scope: !200)
!240 = !DILocation(line: 124, column: 23, scope: !200)
!241 = !DILocation(line: 125, column: 25, scope: !200)
!242 = !DILocation(line: 125, column: 31, scope: !200)
!243 = !DILocation(line: 125, column: 5, scope: !200)
!244 = !DILocation(line: 125, column: 12, scope: !200)
!245 = !DILocation(line: 125, column: 23, scope: !200)
!246 = !DILocation(line: 126, column: 25, scope: !200)
!247 = !DILocation(line: 126, column: 31, scope: !200)
!248 = !DILocation(line: 126, column: 5, scope: !200)
!249 = !DILocation(line: 126, column: 12, scope: !200)
!250 = !DILocation(line: 126, column: 23, scope: !200)
!251 = !DILocation(line: 127, column: 25, scope: !200)
!252 = !DILocation(line: 127, column: 31, scope: !200)
!253 = !DILocation(line: 127, column: 5, scope: !200)
!254 = !DILocation(line: 127, column: 12, scope: !200)
