; ModuleID = 'treetable_get_first_key_linked.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_conf_s = type { ptr, ptr, ptr, ptr }
%struct.rbnode_s = type { ptr, ptr, i8, ptr, ptr, ptr }
%struct.treetable_s = type { ptr, ptr, i64, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"k1\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"k2\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [3 x i8] c"k3\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [3 x i8] c"v1\00", align 1, !dbg !11
@.str.4 = private unnamed_addr constant [3 x i8] c"v2\00", align 1, !dbg !13
@.str.5 = private unnamed_addr constant [3 x i8] c"v3\00", align 1, !dbg !15
@.str.6 = private unnamed_addr constant [57 x i8] c"treetable_get_first_key(t, &out) == CC_ERR_KEY_NOT_FOUND\00", align 1, !dbg !17
@.str.7 = private unnamed_addr constant [48 x i8] c"Ex3SymbTestSuite/treetable_get_first_key_symb.c\00", align 1, !dbg !22
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1, !dbg !27
@.str.8 = private unnamed_addr constant [10 x i8] c"sorted(t)\00", align 1, !dbg !33
@.str.9 = private unnamed_addr constant [12 x i8] c"balanced(t)\00", align 1, !dbg !38

!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !50, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !50, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 51)
!60 = distinct !DICompileUnit(language: DW_LANG_C11, file: !61, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !76, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "../ex2/treetable.c", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "cd091c12d74f379a3d467a2d81b73c3b")
!62 = !{!63}
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_stat", file: !64, line: 29, baseType: !65, size: 32, elements: !66)
!64 = !DIFile(filename: "../ex2/common.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "e8c1045b469e28a9ccd16d92bf989e73")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIEnumerator(name: "CC_OK", value: 0)
!68 = !DIEnumerator(name: "CC_ERR_ALLOC", value: 1)
!69 = !DIEnumerator(name: "CC_ERR_INVALID_CAPACITY", value: 2)
!70 = !DIEnumerator(name: "CC_ERR_INVALID_RANGE", value: 3)
!71 = !DIEnumerator(name: "CC_ERR_MAX_CAPACITY", value: 4)
!72 = !DIEnumerator(name: "CC_ERR_KEY_NOT_FOUND", value: 6)
!73 = !DIEnumerator(name: "CC_ERR_VALUE_NOT_FOUND", value: 7)
!74 = !DIEnumerator(name: "CC_ERR_OUT_OF_RANGE", value: 8)
!75 = !DIEnumerator(name: "CC_ITER_END", value: 9)
!76 = !{!77, !79}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !81, globals: !82, splitDebugInlining: false, nameTableKind: None)
!81 = !{!77}
!82 = !{!0, !7, !9, !11, !13, !15, !17, !22, !27, !33, !38, !43, !48, !51, !53, !55}
!83 = !{!"clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)"}
!84 = !{i32 7, !"Dwarf Version", i32 5}
!85 = !{i32 2, !"Debug Info Version", i32 3}
!86 = !{i32 1, !"wchar_size", i32 4}
!87 = !{i32 8, !"PIC Level", i32 2}
!88 = !{i32 7, !"PIE Level", i32 2}
!89 = !{i32 7, !"uwtable", i32 2}
!90 = !{i32 7, !"frame-pointer", i32 2}
!91 = distinct !DISubprogram(name: "cmp", scope: !61, file: !61, line: 53, type: !92, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !96)
!92 = !DISubroutineType(types: !93)
!93 = !{!78, !94, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!96 = !{}
!97 = !DILocalVariable(name: "e1", arg: 1, scope: !91, file: !61, line: 53, type: !94)
!98 = !DILocation(line: 53, column: 21, scope: !91)
!99 = !DILocalVariable(name: "e2", arg: 2, scope: !91, file: !61, line: 53, type: !94)
!100 = !DILocation(line: 53, column: 37, scope: !91)
!101 = !DILocalVariable(name: "i", scope: !91, file: !61, line: 54, type: !78)
!102 = !DILocation(line: 54, column: 9, scope: !91)
!103 = !DILocation(line: 54, column: 22, scope: !91)
!104 = !DILocation(line: 54, column: 13, scope: !91)
!105 = !DILocalVariable(name: "j", scope: !91, file: !61, line: 55, type: !78)
!106 = !DILocation(line: 55, column: 9, scope: !91)
!107 = !DILocation(line: 55, column: 22, scope: !91)
!108 = !DILocation(line: 55, column: 13, scope: !91)
!109 = !DILocation(line: 57, column: 9, scope: !110)
!110 = distinct !DILexicalBlock(scope: !91, file: !61, line: 57, column: 9)
!111 = !DILocation(line: 57, column: 13, scope: !110)
!112 = !DILocation(line: 57, column: 11, scope: !110)
!113 = !DILocation(line: 57, column: 9, scope: !91)
!114 = !DILocation(line: 58, column: 9, scope: !110)
!115 = !DILocation(line: 59, column: 9, scope: !116)
!116 = distinct !DILexicalBlock(scope: !91, file: !61, line: 59, column: 9)
!117 = !DILocation(line: 59, column: 14, scope: !116)
!118 = !DILocation(line: 59, column: 11, scope: !116)
!119 = !DILocation(line: 59, column: 9, scope: !91)
!120 = !DILocation(line: 60, column: 9, scope: !116)
!121 = !DILocation(line: 61, column: 5, scope: !91)
!122 = !DILocation(line: 62, column: 1, scope: !91)
!123 = distinct !DISubprogram(name: "treetable_conf_init", scope: !61, file: !61, line: 70, type: !124, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !96)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !128, line: 94, baseType: !129)
!128 = !DIFile(filename: "../ex2/treetable.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "065f0d2b52ad730b442c75c554f59b69")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !128, line: 89, size: 256, elements: !130)
!130 = !{!131, !133, !140, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !129, file: !128, line: 90, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !129, file: !128, line: 91, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!79, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 46, baseType: !139)
!138 = !DIFile(filename: "/tmp/llvm-160-install_O_D_A/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!139 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !129, file: !128, line: 92, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!79, !137, !137}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !129, file: !128, line: 93, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !79}
!148 = !DILocalVariable(name: "conf", arg: 1, scope: !123, file: !61, line: 70, type: !126)
!149 = !DILocation(line: 70, column: 41, scope: !123)
!150 = !DILocation(line: 72, column: 5, scope: !123)
!151 = !DILocation(line: 72, column: 11, scope: !123)
!152 = !DILocation(line: 72, column: 22, scope: !123)
!153 = !DILocation(line: 73, column: 5, scope: !123)
!154 = !DILocation(line: 73, column: 11, scope: !123)
!155 = !DILocation(line: 73, column: 22, scope: !123)
!156 = !DILocation(line: 74, column: 5, scope: !123)
!157 = !DILocation(line: 74, column: 11, scope: !123)
!158 = !DILocation(line: 74, column: 22, scope: !123)
!159 = !DILocation(line: 75, column: 5, scope: !123)
!160 = !DILocation(line: 75, column: 11, scope: !123)
!161 = !DILocation(line: 75, column: 22, scope: !123)
!162 = !DILocation(line: 76, column: 1, scope: !123)
!163 = distinct !DISubprogram(name: "treetable_new", scope: !61, file: !61, line: 87, type: !164, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !96)
!164 = !DISubroutineType(types: !165)
!165 = !{!63, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !128, line: 30, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !61, line: 30, size: 448, elements: !170)
!170 = !{!171, !183, !184, !185, !186, !187, !188}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !169, file: !61, line: 31, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !128, line: 61, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !128, line: 37, size: 384, elements: !175)
!175 = !{!176, !177, !178, !179, !181, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !174, file: !128, line: 40, baseType: !79, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !174, file: !128, line: 44, baseType: !79, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !174, file: !128, line: 48, baseType: !4, size: 8, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !174, file: !128, line: 52, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !174, file: !128, line: 56, baseType: !180, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !174, file: !128, line: 60, baseType: !180, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !169, file: !61, line: 32, baseType: !172, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !169, file: !61, line: 33, baseType: !137, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !169, file: !61, line: 35, baseType: !132, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !169, file: !61, line: 36, baseType: !134, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !169, file: !61, line: 37, baseType: !141, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !169, file: !61, line: 38, baseType: !145, size: 64, offset: 384)
!189 = !DILocalVariable(name: "tt", arg: 1, scope: !163, file: !61, line: 87, type: !166)
!190 = !DILocation(line: 87, column: 40, scope: !163)
!191 = !DILocalVariable(name: "conf", scope: !163, file: !61, line: 89, type: !127)
!192 = !DILocation(line: 89, column: 19, scope: !163)
!193 = !DILocation(line: 90, column: 5, scope: !163)
!194 = !DILocation(line: 91, column: 38, scope: !163)
!195 = !DILocation(line: 91, column: 12, scope: !163)
!196 = !DILocation(line: 91, column: 5, scope: !163)
!197 = distinct !DISubprogram(name: "treetable_new_conf", scope: !61, file: !61, line: 107, type: !198, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !96)
!198 = !DISubroutineType(types: !199)
!199 = !{!63, !200, !166}
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!203 = !DILocalVariable(name: "conf", arg: 1, scope: !197, file: !61, line: 107, type: !200)
!204 = !DILocation(line: 107, column: 61, scope: !197)
!205 = !DILocalVariable(name: "tt", arg: 2, scope: !197, file: !61, line: 107, type: !166)
!206 = !DILocation(line: 107, column: 79, scope: !197)
!207 = !DILocalVariable(name: "table", scope: !197, file: !61, line: 109, type: !167)
!208 = !DILocation(line: 109, column: 16, scope: !197)
!209 = !DILocation(line: 109, column: 24, scope: !197)
!210 = !DILocation(line: 109, column: 30, scope: !197)
!211 = !DILocation(line: 111, column: 10, scope: !212)
!212 = distinct !DILexicalBlock(scope: !197, file: !61, line: 111, column: 9)
!213 = !DILocation(line: 111, column: 9, scope: !197)
!214 = !DILocation(line: 112, column: 9, scope: !212)
!215 = !DILocalVariable(name: "sentinel", scope: !197, file: !61, line: 114, type: !172)
!216 = !DILocation(line: 114, column: 13, scope: !197)
!217 = !DILocation(line: 114, column: 24, scope: !197)
!218 = !DILocation(line: 114, column: 30, scope: !197)
!219 = !DILocation(line: 116, column: 10, scope: !220)
!220 = distinct !DILexicalBlock(scope: !197, file: !61, line: 116, column: 9)
!221 = !DILocation(line: 116, column: 9, scope: !197)
!222 = !DILocation(line: 117, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !61, line: 116, column: 20)
!224 = !DILocation(line: 117, column: 15, scope: !223)
!225 = !DILocation(line: 117, column: 24, scope: !223)
!226 = !DILocation(line: 118, column: 9, scope: !223)
!227 = !DILocation(line: 121, column: 5, scope: !197)
!228 = !DILocation(line: 121, column: 15, scope: !197)
!229 = !DILocation(line: 121, column: 23, scope: !197)
!230 = !DILocation(line: 123, column: 5, scope: !197)
!231 = !DILocation(line: 123, column: 12, scope: !197)
!232 = !DILocation(line: 123, column: 23, scope: !197)
!233 = !DILocation(line: 124, column: 25, scope: !197)
!234 = !DILocation(line: 124, column: 31, scope: !197)
!235 = !DILocation(line: 124, column: 5, scope: !197)
!236 = !DILocation(line: 124, column: 12, scope: !197)
!237 = !DILocation(line: 124, column: 23, scope: !197)
!238 = !DILocation(line: 125, column: 25, scope: !197)
!239 = !DILocation(line: 125, column: 31, scope: !197)
!240 = !DILocation(line: 125, column: 5, scope: !197)
!241 = !DILocation(line: 125, column: 12, scope: !197)
!242 = !DILocation(line: 125, column: 23, scope: !197)
!243 = !DILocation(line: 126, column: 25, scope: !197)
!244 = !DILocation(line: 126, column: 31, scope: !197)
!245 = !DILocation(line: 126, column: 5, scope: !197)
!246 = !DILocation(line: 126, column: 12, scope: !197)
!247 = !DILocation(line: 126, column: 23, scope: !197)
!248 = !DILocation(line: 127, column: 25, scope: !197)
!249 = !DILocation(line: 127, column: 31, scope: !197)
!250 = !DILocation(line: 127, column: 5, scope: !197)
!251 = !DILocation(line: 127, column: 12, scope: !197)
