; ModuleID = 'treetable_get_greater_than_linked.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_conf_s = type { ptr, ptr, ptr, ptr }
%struct.rbnode_s = type { ptr, ptr, i8, ptr, ptr, ptr }
%struct.treetable_s = type { ptr, ptr, i64, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"k1\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"k2\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [3 x i8] c"k3\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [3 x i8] c"v1\00", align 1, !dbg !11
@.str.4 = private unnamed_addr constant [3 x i8] c"v2\00", align 1, !dbg !13
@.str.5 = private unnamed_addr constant [3 x i8] c"v3\00", align 1, !dbg !15
@.str.6 = private unnamed_addr constant [10 x i8] c"sorted(t)\00", align 1, !dbg !17
@.str.7 = private unnamed_addr constant [51 x i8] c"Ex3SymbTestSuite/treetable_get_greater_than_symb.c\00", align 1, !dbg !22
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1, !dbg !27
@.str.8 = private unnamed_addr constant [12 x i8] c"balanced(t)\00", align 1, !dbg !33
@.str.9 = private unnamed_addr constant [15 x i8] c"successor > k1\00", align 1, !dbg !38
@.str.10 = private unnamed_addr constant [54 x i8] c"successor == k1 || successor == k2 || successor == k3\00", align 1, !dbg !41

!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !31)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 54)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 31)
!51 = distinct !DICompileUnit(language: DW_LANG_C11, file: !52, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !53, retainedTypes: !67, splitDebugInlining: false, nameTableKind: None)
!52 = !DIFile(filename: "../ex2/treetable.c", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "cd091c12d74f379a3d467a2d81b73c3b")
!53 = !{!54}
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_stat", file: !55, line: 29, baseType: !56, size: 32, elements: !57)
!55 = !DIFile(filename: "../ex2/common.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "e8c1045b469e28a9ccd16d92bf989e73")
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIEnumerator(name: "CC_OK", value: 0)
!59 = !DIEnumerator(name: "CC_ERR_ALLOC", value: 1)
!60 = !DIEnumerator(name: "CC_ERR_INVALID_CAPACITY", value: 2)
!61 = !DIEnumerator(name: "CC_ERR_INVALID_RANGE", value: 3)
!62 = !DIEnumerator(name: "CC_ERR_MAX_CAPACITY", value: 4)
!63 = !DIEnumerator(name: "CC_ERR_KEY_NOT_FOUND", value: 6)
!64 = !DIEnumerator(name: "CC_ERR_VALUE_NOT_FOUND", value: 7)
!65 = !DIEnumerator(name: "CC_ERR_OUT_OF_RANGE", value: 8)
!66 = !DIEnumerator(name: "CC_ITER_END", value: 9)
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !53, retainedTypes: !72, globals: !73, splitDebugInlining: false, nameTableKind: None)
!72 = !{!68}
!73 = !{!0, !7, !9, !11, !13, !15, !17, !22, !27, !33, !38, !41, !46}
!74 = !{!"clang version 16.0.6 (https://github.com/llvm/llvm-project.git 7cbf1a2591520c2491aa35339f227775f4d3adf6)"}
!75 = !{i32 7, !"Dwarf Version", i32 5}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{i32 8, !"PIC Level", i32 2}
!79 = !{i32 7, !"PIE Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 2}
!81 = !{i32 7, !"frame-pointer", i32 2}
!82 = distinct !DISubprogram(name: "cmp", scope: !52, file: !52, line: 53, type: !83, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{!69, !85, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!87 = !{}
!88 = !DILocalVariable(name: "e1", arg: 1, scope: !82, file: !52, line: 53, type: !85)
!89 = !DILocation(line: 53, column: 21, scope: !82)
!90 = !DILocalVariable(name: "e2", arg: 2, scope: !82, file: !52, line: 53, type: !85)
!91 = !DILocation(line: 53, column: 37, scope: !82)
!92 = !DILocalVariable(name: "i", scope: !82, file: !52, line: 54, type: !69)
!93 = !DILocation(line: 54, column: 9, scope: !82)
!94 = !DILocation(line: 54, column: 22, scope: !82)
!95 = !DILocation(line: 54, column: 13, scope: !82)
!96 = !DILocalVariable(name: "j", scope: !82, file: !52, line: 55, type: !69)
!97 = !DILocation(line: 55, column: 9, scope: !82)
!98 = !DILocation(line: 55, column: 22, scope: !82)
!99 = !DILocation(line: 55, column: 13, scope: !82)
!100 = !DILocation(line: 57, column: 9, scope: !101)
!101 = distinct !DILexicalBlock(scope: !82, file: !52, line: 57, column: 9)
!102 = !DILocation(line: 57, column: 13, scope: !101)
!103 = !DILocation(line: 57, column: 11, scope: !101)
!104 = !DILocation(line: 57, column: 9, scope: !82)
!105 = !DILocation(line: 58, column: 9, scope: !101)
!106 = !DILocation(line: 59, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !82, file: !52, line: 59, column: 9)
!108 = !DILocation(line: 59, column: 14, scope: !107)
!109 = !DILocation(line: 59, column: 11, scope: !107)
!110 = !DILocation(line: 59, column: 9, scope: !82)
!111 = !DILocation(line: 60, column: 9, scope: !107)
!112 = !DILocation(line: 61, column: 5, scope: !82)
!113 = !DILocation(line: 62, column: 1, scope: !82)
!114 = distinct !DISubprogram(name: "treetable_conf_init", scope: !52, file: !52, line: 70, type: !115, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !87)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !119, line: 94, baseType: !120)
!119 = !DIFile(filename: "../ex2/treetable.h", directory: "/home/klee/work/ex3", checksumkind: CSK_MD5, checksum: "065f0d2b52ad730b442c75c554f59b69")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !119, line: 89, size: 256, elements: !121)
!121 = !{!122, !124, !131, !135}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !120, file: !119, line: 90, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !120, file: !119, line: 91, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!70, !128}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !129, line: 46, baseType: !130)
!129 = !DIFile(filename: "/tmp/llvm-160-install_O_D_A/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!130 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !120, file: !119, line: 92, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!70, !128, !128}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !120, file: !119, line: 93, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !70}
!139 = !DILocalVariable(name: "conf", arg: 1, scope: !114, file: !52, line: 70, type: !117)
!140 = !DILocation(line: 70, column: 41, scope: !114)
!141 = !DILocation(line: 72, column: 5, scope: !114)
!142 = !DILocation(line: 72, column: 11, scope: !114)
!143 = !DILocation(line: 72, column: 22, scope: !114)
!144 = !DILocation(line: 73, column: 5, scope: !114)
!145 = !DILocation(line: 73, column: 11, scope: !114)
!146 = !DILocation(line: 73, column: 22, scope: !114)
!147 = !DILocation(line: 74, column: 5, scope: !114)
!148 = !DILocation(line: 74, column: 11, scope: !114)
!149 = !DILocation(line: 74, column: 22, scope: !114)
!150 = !DILocation(line: 75, column: 5, scope: !114)
!151 = !DILocation(line: 75, column: 11, scope: !114)
!152 = !DILocation(line: 75, column: 22, scope: !114)
!153 = !DILocation(line: 76, column: 1, scope: !114)
!154 = distinct !DISubprogram(name: "treetable_new", scope: !52, file: !52, line: 87, type: !155, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !87)
!155 = !DISubroutineType(types: !156)
!156 = !{!54, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !119, line: 30, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !52, line: 30, size: 448, elements: !161)
!161 = !{!162, !174, !175, !176, !177, !178, !179}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !160, file: !52, line: 31, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !119, line: 61, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !119, line: 37, size: 384, elements: !166)
!166 = !{!167, !168, !169, !170, !172, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !165, file: !119, line: 40, baseType: !70, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !165, file: !119, line: 44, baseType: !70, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !165, file: !119, line: 48, baseType: !4, size: 8, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !119, line: 52, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !165, file: !119, line: 56, baseType: !171, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !165, file: !119, line: 60, baseType: !171, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !160, file: !52, line: 32, baseType: !163, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !52, line: 33, baseType: !128, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !160, file: !52, line: 35, baseType: !123, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !160, file: !52, line: 36, baseType: !125, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !160, file: !52, line: 37, baseType: !132, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !160, file: !52, line: 38, baseType: !136, size: 64, offset: 384)
!180 = !DILocalVariable(name: "tt", arg: 1, scope: !154, file: !52, line: 87, type: !157)
!181 = !DILocation(line: 87, column: 40, scope: !154)
!182 = !DILocalVariable(name: "conf", scope: !154, file: !52, line: 89, type: !118)
!183 = !DILocation(line: 89, column: 19, scope: !154)
!184 = !DILocation(line: 90, column: 5, scope: !154)
!185 = !DILocation(line: 91, column: 38, scope: !154)
!186 = !DILocation(line: 91, column: 12, scope: !154)
!187 = !DILocation(line: 91, column: 5, scope: !154)
!188 = distinct !DISubprogram(name: "treetable_new_conf", scope: !52, file: !52, line: 107, type: !189, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !87)
!189 = !DISubroutineType(types: !190)
!190 = !{!54, !191, !157}
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!194 = !DILocalVariable(name: "conf", arg: 1, scope: !188, file: !52, line: 107, type: !191)
!195 = !DILocation(line: 107, column: 61, scope: !188)
!196 = !DILocalVariable(name: "tt", arg: 2, scope: !188, file: !52, line: 107, type: !157)
!197 = !DILocation(line: 107, column: 79, scope: !188)
!198 = !DILocalVariable(name: "table", scope: !188, file: !52, line: 109, type: !158)
!199 = !DILocation(line: 109, column: 16, scope: !188)
!200 = !DILocation(line: 109, column: 24, scope: !188)
!201 = !DILocation(line: 109, column: 30, scope: !188)
!202 = !DILocation(line: 111, column: 10, scope: !203)
!203 = distinct !DILexicalBlock(scope: !188, file: !52, line: 111, column: 9)
!204 = !DILocation(line: 111, column: 9, scope: !188)
!205 = !DILocation(line: 112, column: 9, scope: !203)
!206 = !DILocalVariable(name: "sentinel", scope: !188, file: !52, line: 114, type: !163)
!207 = !DILocation(line: 114, column: 13, scope: !188)
!208 = !DILocation(line: 114, column: 24, scope: !188)
!209 = !DILocation(line: 114, column: 30, scope: !188)
!210 = !DILocation(line: 116, column: 10, scope: !211)
!211 = distinct !DILexicalBlock(scope: !188, file: !52, line: 116, column: 9)
!212 = !DILocation(line: 116, column: 9, scope: !188)
!213 = !DILocation(line: 117, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !211, file: !52, line: 116, column: 20)
!215 = !DILocation(line: 117, column: 15, scope: !214)
!216 = !DILocation(line: 117, column: 24, scope: !214)
!217 = !DILocation(line: 118, column: 9, scope: !214)
!218 = !DILocation(line: 121, column: 5, scope: !188)
!219 = !DILocation(line: 121, column: 15, scope: !188)
!220 = !DILocation(line: 121, column: 23, scope: !188)
!221 = !DILocation(line: 123, column: 5, scope: !188)
!222 = !DILocation(line: 123, column: 12, scope: !188)
!223 = !DILocation(line: 123, column: 23, scope: !188)
!224 = !DILocation(line: 124, column: 25, scope: !188)
!225 = !DILocation(line: 124, column: 31, scope: !188)
!226 = !DILocation(line: 124, column: 5, scope: !188)
!227 = !DILocation(line: 124, column: 12, scope: !188)
!228 = !DILocation(line: 124, column: 23, scope: !188)
!229 = !DILocation(line: 125, column: 25, scope: !188)
!230 = !DILocation(line: 125, column: 31, scope: !188)
!231 = !DILocation(line: 125, column: 5, scope: !188)
!232 = !DILocation(line: 125, column: 12, scope: !188)
!233 = !DILocation(line: 125, column: 23, scope: !188)
!234 = !DILocation(line: 126, column: 25, scope: !188)
!235 = !DILocation(line: 126, column: 31, scope: !188)
!236 = !DILocation(line: 126, column: 5, scope: !188)
!237 = !DILocation(line: 126, column: 12, scope: !188)
!238 = !DILocation(line: 126, column: 23, scope: !188)
!239 = !DILocation(line: 127, column: 25, scope: !188)
!240 = !DILocation(line: 127, column: 31, scope: !188)
!241 = !DILocation(line: 127, column: 5, scope: !188)
!242 = !DILocation(line: 127, column: 12, scope: !188)
